first_routes_and_controllers/app/controllers/artworks_controller.rb

    def create
        art = Artwork.new(artwork_params)
        if art.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Doomed"], ["image_url", "doomed.com"], ["artist_id", 8], ["created_at", "2021-11-11 15:48:58.332094"], ["updated_at", "2021-11-11 15:48:58.332094"]]

    def update
        art = Artwork.find(params[:id])
        art.update!(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Even more DOomed"], ["image_url", "verydoomed.com"], ["updated_at", "2021-11-11 15:49:48.594274"], ["id", 6]]

    def destroy
        render json: Artwork.find(params[:id])
        Artwork.destroy(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]