first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def create
        share = ArtworkShare.new(shares_params)
        if share.save
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 8], ["artwork_id", 10], ["created_at", "2021-11-11 16:20:39.445242"], ["updated_at", "2021-11-11 16:20:39.445242"]]

    def destroy
        render json: ArtworkShare.find(params[:id])
        ArtworkShare.destroy(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 11]]