first_routes_and_controllers/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            render json: user.comments.as_json
        else
            artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]