first_routes_and_controllers/app/controllers/users_controller.rb

    def index
        if params.keys.length == 3
            search = params.values.select{ |value| value != "users" && value != "index"}
            search_term = "%#{search.first}%"
            render json: User.where("UPPER(username) LIKE UPPER('#{search_term}')")
        else
            render json: User.all
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (username LIKE '%#{search}%')
SELECT "users".* FROM "users" WHERE (UPPER(username) LIKE UPPER('%monet%'))

    def update
        user = User.find(params[:id])
        user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "terrance@gmail.com"], ["updated_at", "2021-11-10 21:20:47.195004"], ["id", 4]]

    def destroy
        render json: User.find(params[:id])
        User.destroy(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 12]]

    def favorite
        #artwork_id, ownership_tag(artwork/share)
        user = User.find(params[:id])
        if params[:ownership]
            art = Artwork.find(params[:artwork_id])
        else
            art = ArtworkShares.find(params[:artwork_id])
        end

        art.favorite ? art.update!(favorite: false) : art.update!(favorite: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2021-11-11 21:06:33.963054"], ["id", 6]]

    def list_collection
        # redirect_to controller: :collections, action: :index
        art_ids = Collection.where(name: params[:name], user_id: params[:id]).pluck(:artwork_id)
        arts = Artwork.where('artworks.id IN (?)', art_ids)
---
SELECT "collections"."artwork_id" FROM "collections" WHERE "collections"."name" = $1 AND "collections"."user_id" = $2  [["name", "test"], ["user_id", 14]]
SELECT "artworks".* FROM "artworks" WHERE (artworks.id IN (8,9))