first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def destroy
        User.destroy(params[:id])
        render json: User.all